#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-fZuAPYVAG2GKQrKm

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
random_password.db_password: Refreshing state... [id=none]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_api_gateway_method.actions: Refreshing state... [id=agm-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-i57f4h-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=r8ef9v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-02-04T17:58:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "QcQm09yNbyqB+AVq+3S+oUl1wWGiK6GYLHJUySmDAi4=" -> "VBAwe5JY39uvSZ09pyCr+JDveVKD1c4KZg2A3AviR8g="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-02-04T17:58:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZRZZZQFkhK7W4tgMMdqlsmgMYK/hzRyXnNZN7QXj8Qc=" -> "vwysjWid/UH9W9SRQEf7ENqMg5fJfk6Y+CZTHGSbkCo="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-02-04T17:59:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8jErTvqa+3Xl7yD4SSD3Jgz47NQMXho81/jEe9z5OE=" -> "G0z55n3gJDUDo9K2Tp5y/XgGtqWx9XYGSw4xCOTsGsU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-02-03T21:28:12.819Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 2 estimated
           $80.64/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*